InformationRegisters/упРасчетыУкладкиГрузовPacker3D.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упРасчетыУкладкиГрузовPacker3D</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусРасчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСостоянияПроцессов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>АдресВебСтраницы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбработки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Рейс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючРасчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/упРаботыПоРейсу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упРаботыПоРейсу</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Отменена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Задание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упЗаданиеНаПеревозкуГруза</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упТипыОпераций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДополнительнаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упДополнительныеОперации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяРабот</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВременноеОкноНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВременноеОкноОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрузовоеМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГрузовыеМеста</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяОжидания</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлановоеВремяНачалаРабот</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоГрузов</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоГрузов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоДопОпераций</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоОпераций</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Проблема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПроблемы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресРазгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упАдреса</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выполнена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроблемаПричинаВозникновенияЭтойРаботы</Name>
					<Comment>Хранится последующее действие по работе после разгрузки (отмена работы, возврат в планирование)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.упПроблемы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипРегламентногоДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТипыРегламентныхДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЭкземпляровДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Масса</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Масса</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Объем</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Тара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГрузовыеМеста</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрузРазделен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СкладскаяЯчейка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отложена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапрещеноСозданиеНовойТочкиМаршрута</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Рейс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторРаботы</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтрокаНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/упПеревозчикПоРейсу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упПеревозчикПоРейсу</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСоглашенияСПеревозчиками</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтрагентПеревозчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТипыТС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Водитель1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Водитель2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Экспедитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Рейс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/упСостоянияПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упСостоянияПроцессов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запущен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Остановлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/упТипыОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упТипыОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Погрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разгрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаДокументов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеДокументов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительнаяОперация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыемкаЦенностей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаЦенностей</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/упИнтеграцияССервисомУкладкиГрузов/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Выполним Запуск нового расчёта укладки ящиков в ТС.
//
// Параметры:
//  Рейс  - ДокументСсылка.упРейс - Ссылка на рейс.
//  ДатаРегистрации  - Дата - Дата будет указана в текста запроса.
//
// Возвращаемое значение:
//   Структура   - данные, результата расчета.
//
Функция ЗапуститьНовыйРасчетУкладкиГрузов(Рейс,ДатаРегистрации) Экспорт
	
	ИспользуетсяИнтеграцияСPacker3D = ПолучитьФункциональнуюОпцию("упИспользуетсяИнтеграцияСPacker3D");
	
	Если НЕ ИспользуетсяИнтеграцияСPacker3D Тогда
		ЗаписьЖурналаРегистрации(НСтр("ru = 'ИнтеграцияСPacker3D'"), УровеньЖурналаРегистрации.Ошибка,,, НСтр("ru = 'Интеграция с Packer3D не используется'"));
		Возврат Неопределено;
	КонецЕсли;
	
	АдресСервераPacker3D = упСервисныеФункции.ПолучитьЗначениеКонстанты("упАдресСервераPacker3D");
	ПользовательСервисаPacker3D = упСервисныеФункции.ПолучитьЗначениеКонстанты("упПользовательСервисаPacker3D");
	ПарольСервисаPacker3D = упСервисныеФункции.ПолучитьЗначениеКонстанты("упПарольСервисаPacker3D");

	Если НЕ ЗначениеЗаполнено(АдресСервераPacker3D) ИЛИ НЕ ЗначениеЗаполнено(ПользовательСервисаPacker3D) ИЛИ НЕ ЗначениеЗаполнено(ПарольСервисаPacker3D) Тогда
		ЗаписьЖурналаРегистрации(НСтр("ru = 'ИнтеграцияСPacker3D'"), УровеньЖурналаРегистрации.Ошибка,,, НСтр("ru = 'Интеграция с Packer3D не указаны параметры подключения: адрес сервера, пользователь, пароль'"));
		Возврат Неопределено;
	КонецЕсли;
	
	ТекстXML = ПолучитьТекстРасчётаВФорматеPacker3DXML(Рейс,ДатаРегистрации);
	
	Если ТипЗнч(ТекстXML) = ТИП("Структура") Тогда
		// Вернем структура с ошибками, обращение к сервису не будем выполнять.
		Возврат ТекстXML;
	КонецЕсли;
	
	Попытка
		ПроксиWS = СоздатьПроксиПодключенияКСервису(АдресСервераPacker3D,"newCalc");	
		КлючРасчета = ПроксиWS.newCalc(ПользовательСервисаPacker3D,ПарольСервисаPacker3D,ТекстXML);
	Исключение
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Произошла ошибка при обращении к сервису newCalc SOAP-сервер Packer3D. Рейс %1, дата регистрации расчета %2'"),Строка(Рейс),Формат(ДатаРегистрации,"ДЛФ=DT"));
		ЗаписьЖурналаРегистрации(НСтр("ru = 'ИнтеграцияСPacker3D'"), УровеньЖурналаРегистрации.Ошибка,,,ТекстОшибки);
		Возврат Неопределено;
	КонецПопытки;
	
	ДатаОбработки = ТекущаяДатаСеанса();
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запись = РегистрыСведений.упРасчетыУкладкиГрузовPacker3D.СоздатьМенеджерЗаписи();
	Запись.Рейс = Рейс;
	Запись.КлючРасчета = КлючРасчета;
	Запись.СтатусРасчета = 1;
	Запись.Состояние = Перечисления.упСостоянияПроцессов.Запущен;
	АдресВебСтраницы = СтрЗаменить(НРег(АдресСервераPacker3D),"http","");
	АдресВебСтраницы = СтрЗаменить(НРег(АдресСервераPacker3D),"https","");
	Запись.АдресВебСтраницы = "http" + АдресВебСтраницы + ?(Прав(АдресСервераPacker3D,1)="/","","/") + "order?key=" + КлючРасчета;
	Запись.ДатаОбработки = ДатаОбработки;
	Запись.ДатаРегистрации = ДатаРегистрации;
	Запись.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	СтруктураВозврата = Новый Структура();
	СтруктураВозврата.Вставить("ДатаОбработки",ДатаОбработки);
	СтруктураВозврата.Вставить("КлючРасчета",КлючРасчета);
	СтруктураВозврата.Вставить("Состояние",Запись.Состояние);
	
	Возврат СтруктураВозврата;

КонецФункции // ЗапуститьНовыйРасчетУкладкиГрузов()

// Выполним остановку расчёта укладки ящиков в ТС.
//
// Параметры:
//  Рейс  - ДокументСсылка.упРейс - Ссылка на документ.
//  КлючРасчета  - Строка - строка, содержащая уникальный ключ расчёта.
//  Отменить  - Булево - Вне зависимости от статуса отменить расчет.
//
// Возвращаемое значение:
//   Структура   - данные, результата расчета.
//
Функция ОстановитьРасчетУкладкиГрузов(Рейс, КлючРасчета, Отменить = Неопределено) Экспорт
	
	ИспользуетсяИнтеграцияСPacker3D = ПолучитьФункциональнуюОпцию("упИспользуетсяИнтеграцияСPacker3D");
	
	Если НЕ ИспользуетсяИнтеграцияСPacker3D Тогда
		ЗаписьЖурналаРегистрации(НСтр("ru = 'ИнтеграцияСPacker3D'"), УровеньЖурналаРегистрации.Ошибка,,, НСтр("ru = 'Интеграция с Packer3D не используется'"));
		Возврат Неопределено;
	КонецЕсли;
	
	АдресСервераPacker3D = упСервисныеФункции.ПолучитьЗначениеКонстанты("упАдресСервераPacker3D");
	ПользовательСервисаPacker3D = упСервисныеФункции.ПолучитьЗначениеКонстанты("упПользовательСервисаPacker3D");
	ПарольСервисаPacker3D = упСервисныеФункции.ПолучитьЗначениеКонстанты("упПарольСервисаPacker3D");

	Если НЕ ЗначениеЗаполнено(АдресСервераPacker3D) ИЛИ НЕ ЗначениеЗаполнено(ПользовательСервисаPacker3D) ИЛИ НЕ ЗначениеЗаполнено(ПарольСервисаPacker3D) Тогда
		ЗаписьЖурналаРегистрации(НСтр("ru = 'ИнтеграцияСPacker3D'"), УровеньЖурналаРегистрации.Ошибка,,, НСтр("ru = 'Интеграция с Packer3D не указаны параметры подключения: адрес сервера, пользователь, пароль'"));
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		ПроксиWS = СоздатьПроксиПодключенияКСервису(АдресСервераPacker3D,"cancelCalc");	
		ИдентификаторОшибки = ПроксиWS.cancelCalc(ПользовательСервисаPacker3D,ПарольСервисаPacker3D,КлючРасчета);
	Исключение
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Произошла ошибка при обращении к сервису cancelCalc SOAP-сервер Packer3D. Рейс %1, Ключ Расчета: %2'"),Строка(Рейс),КлючРасчета);
		ЗаписьЖурналаРегистрации(НСтр("ru = 'ИнтеграцияСPacker3D'"), УровеньЖурналаРегистрации.Ошибка,,,ТекстОшибки);
		Возврат Неопределено;
	КонецПопытки;
	
	СтатусРасчета = -3;
	
	Если НЕ ПустаяСтрока(ИдентификаторОшибки) Тогда
		Попытка
			СтатусРасчета = Число(ИдентификаторОшибки);
		Исключение
			СтатусРасчета = 0;
		КонецПопытки;
	КонецЕсли;
	ДатаОбработки = ТекущаяДатаСеанса();
	ОтменитьРасчет = ?(Отменить = Неопределено,Ложь,Истина);
	УстановитьПривилегированныйРежим(Истина);
	
	Запись = РегистрыСведений.упРасчетыУкладкиГрузовPacker3D.СоздатьМенеджерЗаписи();	
	
	Запись.КлючРасчета = КлючРасчета;
	Запись.Рейс = Рейс;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Запись.СтатусРасчета = СтатусРасчета;
		Если ОтменитьРасчет ИЛИ Запись.Состояние = Перечисления.упСостоянияПроцессов.Завершен Тогда
			Запись.Состояние = Перечисления.упСостоянияПроцессов.Отменен;
		Иначе
			Запись.Состояние = Перечисления.упСостоянияПроцессов.Остановлен;
		КонецЕсли;
		Запись.ДатаОбработки = ДатаОбработки;
		Запись.Записать();
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
	СтруктураВозврата = Новый Структура();
	СтруктураВозврата.Вставить("ДатаОбработки",ДатаОбработки);
	СтруктураВозврата.Вставить("КлючРасчета",КлючРасчета);
	СтруктураВозврата.Вставить("СтатусРасчета",СтатусРасчета);
	СтруктураВозврата.Вставить("Состояние",Запись.Состояние);
	
	Возврат СтруктураВозврата;

КонецФункции // ОстановитьРасчетУкладкиГрузов()

// Выполним перезапуск расчёта укладки ящиков в ТС.
//
// Параметры:
//  Рейс		 - ДокументСсылка.упРейс	 - ссылка на рейс.
//  КлючРасчета - Строка				 - строка, содержащая уникальный ключ расчёта.
// 
// Возвращаемое значение:
//  Структура - данные, результата расчета.
//
Функция ВозобновитьРасчетаУкладкиГрузов(Рейс, КлючРасчета) Экспорт
	
	ИспользуетсяИнтеграцияСPacker3D = ПолучитьФункциональнуюОпцию("упИспользуетсяИнтеграцияСPacker3D");
	
	Если НЕ ИспользуетсяИнтеграцияСPacker3D Тогда
		ЗаписьЖурналаРегистрации(НСтр("ru = 'ИнтеграцияСPacker3D'"), УровеньЖурналаРегистрации.Ошибка,,, НСтр("ru = 'Интеграция с Packer3D не используется'"));
		Возврат Неопределено;
	КонецЕсли;
	
	АдресСервераPacker3D = упСервисныеФункции.ПолучитьЗначениеКонстанты("упАдресСервераPacker3D");
	ПользовательСервисаPacker3D = упСервисныеФункции.ПолучитьЗначениеКонстанты("упПользовательСервисаPacker3D");
	ПарольСервисаPacker3D = упСервисныеФункции.ПолучитьЗначениеКонстанты("упПарольСервисаPacker3D");

	Если НЕ ЗначениеЗаполнено(АдресСервераPacker3D) ИЛИ НЕ ЗначениеЗаполнено(ПользовательСервисаPacker3D) ИЛИ НЕ ЗначениеЗаполнено(ПарольСервисаPacker3D) Тогда
		ЗаписьЖурналаРегистрации(НСтр("ru = 'ИнтеграцияСPacker3D'"), УровеньЖурналаРегистрации.Ошибка,,, НСтр("ru = 'Интеграция с Packer3D не указаны параметры подключения: адрес сервера, пользователь, пароль'"));
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		ПроксиWS = СоздатьПроксиПодключенияКСервису(АдресСервераPacker3D,"getStatus");	
		СтатусРасчета = ПроксиWS.getStatus(ПользовательСервисаPacker3D,ПарольСервисаPacker3D,КлючРасчета);
	Исключение
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Произошла ошибка при обращении к сервису getStatus SOAP-сервер Packer3D. Рейс %1, Ключ Расчета: %2'"),Строка(Рейс),КлючРасчета);
		ЗаписьЖурналаРегистрации(НСтр("ru = 'ИнтеграцияСPacker3D'"), УровеньЖурналаРегистрации.Ошибка,,,ТекстОшибки);
		Возврат Неопределено;
	КонецПопытки;
	
	Если НЕ СтатусРасчета = -3 Тогда
		ОписаниеОшибки = СтрШаблон(НСтр("ru = 'Для расчет с ключом %1, получен статус %2. Возбновление расчета, применимо только к отмененным расчётам (тем, которые находятся в статусе -3).'"),КлючРасчета,СтатусРасчета);
		ЗаписьЖурналаРегистрации(НСтр("ru = 'ИнтеграцияСPacker3D'"), УровеньЖурналаРегистрации.Ошибка,,, НСтр("ru = 'Интеграция с Packer3D не используется'"));
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		ПроксиWS = СоздатьПроксиПодключенияКСервису(АдресСервераPacker3D,"resumeCalc");	
		ИдентификаторОшибки = ПроксиWS.resumeCalc(ПользовательСервисаPacker3D,ПарольСервисаPacker3D,КлючРасчета);
	Исключение
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Произошла ошибка при обращении к сервису resumeCalc SOAP-сервер Packer3D. Рейс %1, Ключ Расчета: %2'"),Строка(Рейс),КлючРасчета);
		ЗаписьЖурналаРегистрации(НСтр("ru = 'ИнтеграцияСPacker3D'"), УровеньЖурналаРегистрации.Ошибка,,,ТекстОшибки);
		Возврат Неопределено;
	КонецПопытки;
	
	СтатусРасчета = 1;
	Если НЕ ПустаяСтрока(ИдентификаторОшибки) Тогда
		Попытка
			СтатусРасчета = Число(ИдентификаторОшибки);
		Исключение
			СтатусРасчета = 0;
		КонецПопытки;
	КонецЕсли;
	
	ДатаОбработки = ТекущаяДатаСеанса();
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запись = РегистрыСведений.упРасчетыУкладкиГрузовPacker3D.СоздатьМенеджерЗаписи();	
	
	Запись.КлючРасчета = КлючРасчета;
	Запись.Рейс = Рейс;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Запись.СтатусРасчета = СтатусРасчета;
		Запись.Состояние = Перечисления.упСостоянияПроцессов.Запущен;
		Запись.ДатаОбработки = ДатаОбработки;
		Запись.Записать();
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
	СтруктураВозврата = Новый Структура();
	СтруктураВозврата.Вставить("ДатаОбработки",ДатаОбработки);
	СтруктураВозврата.Вставить("КлючРасчета",КлючРасчета);
	СтруктураВозврата.Вставить("СтатусРасчета",СтатусРасчета);
	СтруктураВозврата.Вставить("Состояние",Запись.Состояние);
	
	Возврат СтруктураВозврата;

КонецФункции // ВозобновитьРасчетаУкладкиГрузов()

// Выполним перезапуск расчёта укладки ящиков в ТС.
//
// Параметры:
//  Рейс		 - ДокументСсылка.упРейс	 - ссылка на рейс.
//  КлючРасчета - Строка	 - строка, содержащая уникальный ключ расчёта.
// 
// Возвращаемое значение:
//  Структура - данные, результата расчета.
//
Функция ОбновитьСтатусРасчетаУкладкиГрузов(Рейс, КлючРасчета) Экспорт
	
	ИспользуетсяИнтеграцияСPacker3D = ПолучитьФункциональнуюОпцию("упИспользуетсяИнтеграцияСPacker3D");
	
	Если НЕ ИспользуетсяИнтеграцияСPacker3D Тогда
		ЗаписьЖурналаРегистрации(НСтр("ru = 'ИнтеграцияСPacker3D'"), УровеньЖурналаРегистрации.Ошибка,,, НСтр("ru = 'Интеграция с Packer3D не используется'"));
		Возврат Неопределено;
	КонецЕсли;
	
	АдресСервераPacker3D = упСервисныеФункции.ПолучитьЗначениеКонстанты("упАдресСервераPacker3D");
	ПользовательСервисаPacker3D = упСервисныеФункции.ПолучитьЗначениеКонстанты("упПользовательСервисаPacker3D");
	ПарольСервисаPacker3D = упСервисныеФункции.ПолучитьЗначениеКонстанты("упПарольСервисаPacker3D");

	Если НЕ ЗначениеЗаполнено(АдресСервераPacker3D) ИЛИ НЕ ЗначениеЗаполнено(ПользовательСервисаPacker3D) ИЛИ НЕ ЗначениеЗаполнено(ПарольСервисаPacker3D) Тогда
		ЗаписьЖурналаРегистрации(НСтр("ru = 'ИнтеграцияСPacker3D'"), УровеньЖурналаРегистрации.Ошибка,,, НСтр("ru = 'Интеграция с Packer3D не указаны параметры подключения: адрес сервера, пользователь, пароль'"));
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		ПроксиWS = СоздатьПроксиПодключенияКСервису(АдресСервераPacker3D,"getStatus");	
		СтатусРасчета = ПроксиWS.getStatus(ПользовательСервисаPacker3D,ПарольСервисаPacker3D,КлючРасчета);
	Исключение
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Произошла ошибка при обращении к сервису getStatus SOAP-сервер Packer3D. Рейс %1, Ключ Расчета: %2'"),Строка(Рейс),КлючРасчета);
		ЗаписьЖурналаРегистрации(НСтр("ru = 'ИнтеграцияСPacker3D'"), УровеньЖурналаРегистрации.Ошибка,,,ТекстОшибки);
		Возврат Неопределено;
	КонецПопытки;
		
	ДатаОбработки = ТекущаяДатаСеанса();
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запись = РегистрыСведений.упРасчетыУкладкиГрузовPacker3D.СоздатьМенеджерЗаписи();	
	
	Запись.КлючРасчета = КлючРасчета;
	Запись.Рейс = Рейс;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Запись.СтатусРасчета = СтатусРасчета;		
		Запись.ДатаОбработки = ДатаОбработки;
		Если СтатусРасчета >=100 И СтатусРасчета <=102 Тогда
			Запись.Состояние = Перечисления.упСостоянияПроцессов.Завершен;
		КонецЕсли;	
		Запись.Записать();
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
	СтруктураВозврата = Новый Структура();
	СтруктураВозврата.Вставить("ДатаОбработки",ДатаОбработки);
	СтруктураВозврата.Вставить("КлючРасчета",КлючРасчета);
	СтруктураВозврата.Вставить("СтатусРасчета",СтатусРасчета);
	СтруктураВозврата.Вставить("Состояние",Запись.Состояние);
	
	Возврат СтруктураВозврата;

КонецФункции // ОбновитьСтатусРасчетаУкладкиГрузов()

// Выполним создание Клиентский прокси для вызова веб-сервиса.
//
// Параметры:
//  АдресСервера  - Строка - Адрес сервера сервиса.
//  МетодСервиса  - Строка - Имя функции сервиса.
//
// Возвращаемое значение:
//   WSПрокси    - Клиентский прокси для вызова веб-сервиса.
//
Функция СоздатьПроксиПодключенияКСервису(АдресСервера,МетодСервиса)
	
	АдресСервераPacker3D = АдресСервера + ?(Прав(АдресСервера,1)="/","","/") + "soap";

	МестоположениеWSDL = АдресСервераPacker3D + "/server.php?WSDL";
	WSОпределения = Новый WSОпределения(МестоположениеWSDL);
	ПроксиWS = Новый WSПрокси(WSОпределения,АдресСервераPacker3D, МетодСервиса,МетодСервиса);
	
	Возврат ПроксиWS;

КонецФункции // СоздатьПроксиПодключенияКСервису()

// Выполним формирование текста данных для расчёта в формате packer3d XML.
//
// Параметры:
//  Рейс  - ДокументСсылка.упРейс - Ссылка на рейс.
//  ДатаРегистрации  - Дата - Дата будет указана в текста запроса.
//
// Возвращаемое значение:
//   Строка - Текст запроса расчета.
//
Функция ПолучитьТекстРасчётаВФорматеPacker3DXML(Рейс,ДатаРегистрации)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	упРаботыПоРейсуСрезПоследних.Рейс,
	|	упРаботыПоРейсуСрезПоследних.СтрокаНомер КАК СтрокаНомер,
	|	упРаботыПоРейсуСрезПоследних.ГрузовоеМесто,
	|	упГрузовыеМеста.Высота,
	|	упГрузовыеМеста.Длина,
	|	упГрузовыеМеста.Масса,
	|	упГрузовыеМеста.Объем,
	|	упГрузовыеМеста.Ширина,
	|	упГрузовыеМеста.Сумма,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(упГрузовыеМеста.Ссылка) КАК ПредставлениеГрузовоеМесто,
	|	упГрузовыеМеста.Код КАК Код
	|ИЗ
	|	РегистрСведений.упРаботыПоРейсу.СрезПоследних(, Рейс = &Рейс) КАК упРаботыПоРейсуСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.упГрузовыеМеста КАК упГрузовыеМеста
	|		ПО упРаботыПоРейсуСрезПоследних.ГрузовоеМесто = упГрузовыеМеста.Ссылка
	|ГДЕ
	|	упРаботыПоРейсуСрезПоследних.Рейс = &Рейс
	|	И упРаботыПоРейсуСрезПоследних.Операция = ЗНАЧЕНИЕ(Перечисление.упТипыОпераций.Погрузка)
	|	И НЕ упРаботыПоРейсуСрезПоследних.Отменена
	|
	|УПОРЯДОЧИТЬ ПО
	|	СтрокаНомер,
	|	Код
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	упПеревозчикПоРейсуСрезПоследних.Рейс,
	|	упПеревозчикПоРейсуСрезПоследних.ТранспортноеСредство КАК ТС,
	|	упТранспортныеСредства.Наименование,
	|	упТранспортныеСредства.Высота,
	|	упТранспортныеСредства.Грузоподъемность,
	|	упТранспортныеСредства.Длина,
	|	упТранспортныеСредства.Объем,
	|	упТранспортныеСредства.Ширина
	|ИЗ
	|	РегистрСведений.упПеревозчикПоРейсу.СрезПоследних(, Рейс = &Рейс) КАК упПеревозчикПоРейсуСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.упТранспортныеСредства КАК упТранспортныеСредства
	|		ПО упПеревозчикПоРейсуСрезПоследних.ТранспортноеСредство = упТранспортныеСредства.Ссылка";
	
	Запрос.УстановитьПараметр("Рейс", Рейс);
	
	ПредставлениеРейса = Строка(Рейс);
	ПолеГрузовыхМест = "ЗаданияГрузовоеМесто";
	ПолеТранспортноеСредство = "ТранспортноеСредство";
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	МассивОшибки = Новый Массив;
	Если ПакетЗапросов[0].Пустой() Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Для рейса ""%1"" не обнаружено грузовых мест.'"),ПредставлениеРейса);
		Структура = Новый Структура;
		Структура.Вставить("Текст",ТекстОшибки);
		Структура.Вставить("Поле",ПолеГрузовыхМест);
		МассивОшибки.Добавить(Структура);
	КонецЕсли;
	
	Если ПакетЗапросов[1].Пустой() Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Для рейса ""%1"" не указаны транспортные средства.'"),ПредставлениеРейса);
		Структура = Новый Структура;
		Структура.Вставить("Текст",ТекстОшибки);
		Структура.Вставить("Поле",ПолеТранспортноеСредство);
		МассивОшибки.Добавить(Структура);
	КонецЕсли;
	
	Выборка = ПакетЗапросов[0].Выбрать();
	ВыборкаТС = ПакетЗапросов[1].Выбрать();
	
	ТекущийФормат = "ЧРД=.; ЧН=0; ЧГ=0";
	КоэффициентПересчетаМассы = упСервисныеФункции.ПолучитьЗначениеКонстанты("упКоэффициентПересчетаМассы");
	КоэффициентПересчетаМассы = ?(КоэффициентПересчетаМассы=0,1,КоэффициентПересчетаМассы);
	
	XMLЗапись = Новый ЗаписьXML;
	XMLЗапись.УстановитьСтроку("UTF-8");
	
	XMLЗапись.ЗаписатьОбъявлениеXML();
	XMLЗапись.ЗаписатьНачалоЭлемента("dapl");
	XMLЗапись.ЗаписатьАтрибут("object", "solution");
	XMLЗапись.ЗаписатьАтрибут("version", "1.4");
	XMLЗапись.ЗаписатьАтрибут("storage", "Solution");
	 XMLЗапись.ЗаписатьНачалоЭлемента("element");
	 XMLЗапись.ЗаписатьАтрибут("type", "RootRef");
	 XMLЗапись.ЗаписатьАтрибут("name", "alg");
	 XMLЗапись.ЗаписатьАтрибут("val", "1");
	 XMLЗапись.ЗаписатьАтрибут("storage", "AlgParam");
	  XMLЗапись.ЗаписатьНачалоЭлемента("element");
	  XMLЗапись.ЗаписатьАтрибут("type", "ULong");
	  XMLЗапись.ЗаписатьАтрибут("name", "speed");
	  XMLЗапись.ЗаписатьТекст("0");
	  XMLЗапись.ЗаписатьКонецЭлемента();
	  XMLЗапись.ЗаписатьНачалоЭлемента("element");
	  XMLЗапись.ЗаписатьАтрибут("type", "Bool");
	  XMLЗапись.ЗаписатьАтрибут("name", "tonnage");
	  XMLЗапись.ЗаписатьТекст("1");
	  XMLЗапись.ЗаписатьКонецЭлемента();
	  XMLЗапись.ЗаписатьНачалоЭлемента("element");
	  XMLЗапись.ЗаписатьАтрибут("type", "Bool");
	  XMLЗапись.ЗаписатьАтрибут("name", "group");
	  XMLЗапись.ЗаписатьТекст("1");
	  XMLЗапись.ЗаписатьКонецЭлемента();
	  XMLЗапись.ЗаписатьНачалоЭлемента("element");
	  XMLЗапись.ЗаписатьАтрибут("type", "Bool");
	  XMLЗапись.ЗаписатьАтрибут("name", "order");
	  XMLЗапись.ЗаписатьТекст("1");
	  XMLЗапись.ЗаписатьКонецЭлемента();
	  XMLЗапись.ЗаписатьНачалоЭлемента("element");
	  XMLЗапись.ЗаписатьАтрибут("type", "Bool");
	  XMLЗапись.ЗаписатьАтрибут("name", "price");
	  XMLЗапись.ЗаписатьТекст("1");
	  XMLЗапись.ЗаписатьКонецЭлемента();
	  XMLЗапись.ЗаписатьНачалоЭлемента("element");
	  XMLЗапись.ЗаписатьАтрибут("type", "Bool");
	  XMLЗапись.ЗаписатьАтрибут("name", "roof");
	  XMLЗапись.ЗаписатьТекст("1");
	  XMLЗапись.ЗаписатьКонецЭлемента();
	  XMLЗапись.ЗаписатьНачалоЭлемента("element");
	  XMLЗапись.ЗаписатьАтрибут("type", "UShort");
	  XMLЗапись.ЗаписатьАтрибут("name", "compact");
	  XMLЗапись.ЗаписатьТекст("0");
	  XMLЗапись.ЗаписатьКонецЭлемента();
	  XMLЗапись.ЗаписатьНачалоЭлемента("element");
	  XMLЗапись.ЗаписатьАтрибут("type", "Bool");
	  XMLЗапись.ЗаписатьАтрибут("name", "axles");
	  XMLЗапись.ЗаписатьТекст("1");
	  XMLЗапись.ЗаписатьКонецЭлемента();
	  XMLЗапись.ЗаписатьНачалоЭлемента("element");
	  XMLЗапись.ЗаписатьАтрибут("type", "ULong");
	  XMLЗапись.ЗаписатьАтрибут("name", "overfall");
	  XMLЗапись.ЗаписатьТекст("0");
	  XMLЗапись.ЗаписатьКонецЭлемента();	  
	  XMLЗапись.ЗаписатьНачалоЭлемента("element");
	  XMLЗапись.ЗаписатьАтрибут("type", "ULong");
	  XMLЗапись.ЗаписатьАтрибут("name", "chink_size");
	  XMLЗапись.ЗаписатьТекст("0");
	  XMLЗапись.ЗаписатьКонецЭлемента();
	  XMLЗапись.ЗаписатьНачалоЭлемента("element");
	  XMLЗапись.ЗаписатьАтрибут("type", "ULong");
	  XMLЗапись.ЗаписатьАтрибут("name", "break_size");
	  XMLЗапись.ЗаписатьТекст("0");
	  XMLЗапись.ЗаписатьКонецЭлемента();
	  XMLЗапись.ЗаписатьНачалоЭлемента("element");
	  XMLЗапись.ЗаписатьАтрибут("type", "ULong");
	  XMLЗапись.ЗаписатьАтрибут("name", "pallet");
	  XMLЗапись.ЗаписатьТекст("1");
	  XMLЗапись.ЗаписатьКонецЭлемента();
	  XMLЗапись.ЗаписатьНачалоЭлемента("element");
	  XMLЗапись.ЗаписатьАтрибут("type", "UShort");
	  XMLЗапись.ЗаписатьАтрибут("name", "pack_principle");
	  XMLЗапись.ЗаписатьТекст("0");
	  XMLЗапись.ЗаписатьКонецЭлемента();
	  XMLЗапись.ЗаписатьНачалоЭлемента("element");
	  XMLЗапись.ЗаписатьАтрибут("type", "ULong");
	  XMLЗапись.ЗаписатьАтрибут("name", "block_staff");
	  XMLЗапись.ЗаписатьТекст("0");
	  XMLЗапись.ЗаписатьКонецЭлемента();
	  XMLЗапись.ЗаписатьНачалоЭлемента("element");
	  XMLЗапись.ЗаписатьАтрибут("type", "Bool");
	  XMLЗапись.ЗаписатьАтрибут("name", "fragility");
	  XMLЗапись.ЗаписатьТекст("1");
	  XMLЗапись.ЗаписатьКонецЭлемента();
	  XMLЗапись.ЗаписатьНачалоЭлемента("element");
	  XMLЗапись.ЗаписатьАтрибут("type", "Bool");
	  XMLЗапись.ЗаписатьАтрибут("name", "pack_level");
	  XMLЗапись.ЗаписатьТекст("1");
	  XMLЗапись.ЗаписатьКонецЭлемента();
	  XMLЗапись.ЗаписатьНачалоЭлемента("element");
	  XMLЗапись.ЗаписатьАтрибут("type", "Bool");
	  XMLЗапись.ЗаписатьАтрибут("name", "freezable");
	  XMLЗапись.ЗаписатьТекст("1");
	  XMLЗапись.ЗаписатьКонецЭлемента();
	  XMLЗапись.ЗаписатьНачалоЭлемента("element");
	  XMLЗапись.ЗаписатьАтрибут("type", "ULong");
	  XMLЗапись.ЗаписатьАтрибут("name", "door_area");
	  XMLЗапись.ЗаписатьТекст("500");
	  XMLЗапись.ЗаписатьКонецЭлемента();
	  XMLЗапись.ЗаписатьНачалоЭлемента("element");
	  XMLЗапись.ЗаписатьАтрибут("type", "Bool");
	  XMLЗапись.ЗаписатьАтрибут("name", "item_press");
	  XMLЗапись.ЗаписатьТекст("1");
	  XMLЗапись.ЗаписатьКонецЭлемента();
	  XMLЗапись.ЗаписатьНачалоЭлемента("element");
	  XMLЗапись.ЗаписатьАтрибут("type", "Bool");
	  XMLЗапись.ЗаписатьАтрибут("name", "tare_bulk");
	  XMLЗапись.ЗаписатьТекст("1");
	  XMLЗапись.ЗаписатьКонецЭлемента();
	  XMLЗапись.ЗаписатьНачалоЭлемента("element");
	  XMLЗапись.ЗаписатьАтрибут("type", "Bool");
	  XMLЗапись.ЗаписатьАтрибут("name", "only4bottom");
	  XMLЗапись.ЗаписатьТекст("1");
	  XMLЗапись.ЗаписатьКонецЭлемента();
	  XMLЗапись.ЗаписатьНачалоЭлемента("element");
	  XMLЗапись.ЗаписатьАтрибут("type", "Bool");
	  XMLЗапись.ЗаписатьАтрибут("name", "dir_restrict");
	  XMLЗапись.ЗаписатьТекст("1");
	  XMLЗапись.ЗаписатьКонецЭлемента();
	  XMLЗапись.ЗаписатьНачалоЭлемента("element");
	  XMLЗапись.ЗаписатьАтрибут("type", "Bool");
	  XMLЗапись.ЗаписатьАтрибут("name", "typify");
	  XMLЗапись.ЗаписатьТекст("0");
	  XMLЗапись.ЗаписатьКонецЭлемента();
	  XMLЗапись.ЗаписатьНачалоЭлемента("element");
	  XMLЗапись.ЗаписатьАтрибут("type", "String");
	  XMLЗапись.ЗаписатьАтрибут("name", "genom");
	  XMLЗапись.ЗаписатьТекст("GENOM	50
	  |PlaneSet3dQualificator::height	1e+06
	  |PlaneSet3dQualificator::pure_volume	10
	  |PlaneSet3dQualificator::pure_square	10
	  |PlaneSet3dQualificator::pure_perimeter	1
	  |PlaneSet3dQualificator::full_volume	1e-06
	  |PlaneSet3dQualificator::full_square	1e-05
	  |PlaneSet3dQualificator::full_perimeter	0.0001
	  |PlaneSet3dQualificator::mean_volume	100
	  |PlaneSet3dQualificator::mean_square	100
	  |PlaneSet3dQualificator::mean_perimeter	100
	  |PlaneSet3dQualificator::mean_lindelta	-100
	  |PlaneSet3dQualificator::mean_sqrdelta	-100
	  |PlaneSet3dQualificator::disp_volume	-1
	  |PlaneSet3dQualificator::disp_square	-1
	  |PlaneSet3dQualificator::disp_perimeter	-1
	  |PlaneSet3dQualificator::disp_lindelta	-10
	  |PlaneSet3dQualificator::disp_sqrdelta	-10
	  |PlaneQualificator::volume	10000
	  |PlaneQualificator::rel_square	100
	  |PlaneQualificator::perimeter	-10
	  |PlaneQualificator::dir_length	-10
	  |PlaneQualificator::min_depth	100
	  |PlaneQualificator::max_depth	-100
	  |PlaneQualificator::top_depth	-1
	  |PlaneQualificator::nobreak_length	-10
	  |PlaneQualificator::reverse_length	-10000
	  |Item2dQualificator::complexity	10
	  |Item2dQualificator::square	5
	  |Item2dQualificator::perimeter	-1
	  |Item2dQualificator::lindelta	-1
	  |PackVol2dQualificator::item_qval	10
	  |PackVol2dQualificator::square	-1000
	  |PackVol2dQualificator::perimeter	-100
	  |PackVol2dQualificator::dir_length	-100
	  |PackVol2dQualificator::min_depth	10000
	  |PackVol2dQualificator::max_depth	-1000
	  |PackVol2dQualificator::nobreak_length	1000
	  |PackVol2dQualificator::reverse_length	-10000
	  |PackVol2dQualificator::mean_impasse_w	100
	  |PackVol2dQualificator::disp_impasse_w	-10
	  |PackVol2dQualificator::mean_impasse_d	-10
	  |PackVol2dQualificator::disp_impasse_d	-1
	  |PackVol2dQualificator::mean_impasse_f	-1
	  |PackVol2dQualificator::disp_impasse_f	-1
	  |RowQualificator::volume	10000
	  |RowQualificator::width	-10
	  |RowQualificator::break_size	-10
	  |RowQualificator::chink_size	-10
	  |RowQualificator::overfall_size	-10
	  |RowQualificator::complexity	10");
	  XMLЗапись.ЗаписатьКонецЭлемента();
	  
	 XMLЗапись.ЗаписатьКонецЭлемента();//element
	 
	 XMLЗапись.ЗаписатьНачалоЭлемента("element");
	 XMLЗапись.ЗаписатьАтрибут("type", "RootRef");
	 XMLЗапись.ЗаписатьАтрибут("name", "task");
	 XMLЗапись.ЗаписатьАтрибут("val", "2");
	 XMLЗапись.ЗаписатьАтрибут("storage", "TaskSimple");
	  XMLЗапись.ЗаписатьНачалоЭлемента("element");
	  XMLЗапись.ЗаписатьАтрибут("type", "String");
	  XMLЗапись.ЗаписатьАтрибут("name", "m_name");
	  XMLЗапись.ЗаписатьТекст("&#x41F;&#x43B;&#x430;&#x43D; &#x417;&#x430;&#x433;&#x440;&#x443;&#x437;&#x43A;&#x438;");
	  XMLЗапись.ЗаписатьКонецЭлемента();
	  XMLЗапись.ЗаписатьНачалоЭлемента("element");
	  XMLЗапись.ЗаписатьАтрибут("type", "String");
	  XMLЗапись.ЗаписатьАтрибут("name", "m_descr");
	  XMLЗапись.ЗаписатьКонецЭлемента();
	  XMLЗапись.ЗаписатьНачалоЭлемента("element");
	  XMLЗапись.ЗаписатьАтрибут("type", "UShort");
	  XMLЗапись.ЗаписатьАтрибут("name", "m_prio");
	  XMLЗапись.ЗаписатьТекст("0");
	  XMLЗапись.ЗаписатьКонецЭлемента();
	  XMLЗапись.ЗаписатьНачалоЭлемента("element");
	  XMLЗапись.ЗаписатьАтрибут("type", "UShort");
	  XMLЗапись.ЗаписатьАтрибут("name", "m_status");
	  XMLЗапись.ЗаписатьТекст("3");
	  XMLЗапись.ЗаписатьКонецЭлемента();
	  
	  XMLЗапись.ЗаписатьНачалоЭлемента("vehicles");
	  XMLЗапись.ЗаписатьАтрибут("val", "3");
	  XMLЗапись.ЗаписатьАтрибут("element", "vlist");
	  Счетчик_val = 4;
	  Если ВыборкаТС.Следующий() Тогда		  
		  Если ВыборкаТС.Длина = 0 Тогда
			  ТекстОшибки = СтрШаблон(НСтр("ru = 'Для Транспортного средства ""%1"", рейса ""%2"" не заполнено ВГХ ""Длина"" .'"),ВыборкаТС.Наименование,ПредставлениеРейса);
			  Структура = Новый Структура;
			  Структура.Вставить("Текст",ТекстОшибки);
			  Структура.Вставить("Поле",ПолеТранспортноеСредство);
			  МассивОшибки.Добавить(Структура);
		  КонецЕсли;
		  Если ВыборкаТС.Ширина = 0 Тогда
			  ТекстОшибки = СтрШаблон(НСтр("ru = 'Для Транспортного средства ""%1"", рейса ""%2"" не заполнено ВГХ ""Ширина"" .'"),ВыборкаТС.Наименование,ПредставлениеРейса);
			  Структура = Новый Структура;
			  Структура.Вставить("Текст",ТекстОшибки);
			  Структура.Вставить("Поле",ПолеТранспортноеСредство);
			  МассивОшибки.Добавить(Структура);
		  КонецЕсли;
		  Если ВыборкаТС.Высота = 0 Тогда
			  ТекстОшибки = СтрШаблон(НСтр("ru = 'Для Транспортного средства ""%1"", рейса ""%2"" не заполнено ВГХ ""Высота"" .'"),ВыборкаТС.Наименование,ПредставлениеРейса);
			  Структура = Новый Структура;
			  Структура.Вставить("Текст",ТекстОшибки);
			  Структура.Вставить("Поле",ПолеТранспортноеСредство);
			  МассивОшибки.Добавить(Структура);
		  КонецЕсли;
		  Если ВыборкаТС.Грузоподъемность = 0 Тогда
			  ТекстОшибки = СтрШаблон(НСтр("ru = 'Для Транспортного средства ""%1"", рейса ""%2"" не заполнено ВГХ ""Грузоподъемность"" .'"),ВыборкаТС.Наименование,ПредставлениеРейса);
			  Структура = Новый Структура;
			  Структура.Вставить("Текст",ТекстОшибки);
			  Структура.Вставить("Поле",ПолеТранспортноеСредство);
			  МассивОшибки.Добавить(Структура);
		  КонецЕсли;
		  XMLЗапись.ЗаписатьНачалоЭлемента("vehicle");
		  XMLЗапись.ЗаписатьАтрибут("val", Формат(Счетчик_val,ТекущийФормат));
		  XMLЗапись.ЗаписатьАтрибут("id", "0");
		  XMLЗапись.ЗаписатьАтрибут("kind", "container");
		   XMLЗапись.ЗаписатьНачалоЭлемента("quantity");
		   XMLЗапись.ЗаписатьТекст("1");
		   XMLЗапись.ЗаписатьКонецЭлемента();
		   XMLЗапись.ЗаписатьНачалоЭлемента("length");
		   XMLЗапись.ЗаписатьТекст(Формат(ВыборкаТС.Длина*1000,ТекущийФормат));
		   XMLЗапись.ЗаписатьКонецЭлемента();
		   XMLЗапись.ЗаписатьНачалоЭлемента("width");
		   XMLЗапись.ЗаписатьТекст(Формат(ВыборкаТС.Ширина*1000,ТекущийФормат));
		   XMLЗапись.ЗаписатьКонецЭлемента();
		   XMLЗапись.ЗаписатьНачалоЭлемента("height");
		   XMLЗапись.ЗаписатьТекст(Формат(ВыборкаТС.Высота*1000,ТекущийФормат));
		   XMLЗапись.ЗаписатьКонецЭлемента();
		   XMLЗапись.ЗаписатьНачалоЭлемента("tonnage");
		   XMLЗапись.ЗаписатьТекст(Формат(ВыборкаТС.Грузоподъемность*КоэффициентПересчетаМассы,ТекущийФормат));
		   XMLЗапись.ЗаписатьКонецЭлемента();
		   XMLЗапись.ЗаписатьНачалоЭлемента("name");
		   XMLЗапись.ЗаписатьТекст(ВыборкаТС.Наименование);
		   XMLЗапись.ЗаписатьКонецЭлемента();
		  XMLЗапись.ЗаписатьКонецЭлемента();
		  Счетчик_val = Счетчик_val+1;
	  КонецЕсли;
	  XMLЗапись.ЗаписатьКонецЭлемента();//vehicles
	  
	  XMLЗапись.ЗаписатьНачалоЭлемента("vehicles");
	  XMLЗапись.ЗаписатьАтрибут("val", Формат(Счетчик_val,ТекущийФормат));
	  XMLЗапись.ЗаписатьАтрибут("element", "plist");
	  XMLЗапись.ЗаписатьКонецЭлемента();
	  
	  Счетчик_val = Счетчик_val+1;
	  
	  XMLЗапись.ЗаписатьНачалоЭлемента("types");
	  XMLЗапись.ЗаписатьАтрибут("val", Формат(Счетчик_val,ТекущийФормат));
	  XMLЗапись.ЗаписатьАтрибут("element", "tlist");
	  XMLЗапись.ЗаписатьКонецЭлемента();
	  
	  Счетчик_val = Счетчик_val+1;
	  
	  XMLЗапись.ЗаписатьНачалоЭлемента("items");
	  XMLЗапись.ЗаписатьАтрибут("val", Формат(Счетчик_val,ТекущийФормат));
	  XMLЗапись.ЗаписатьАтрибут("element", "ilist");
	  Пока Выборка.Следующий() Цикл
		  Если Выборка.Длина = 0 Тогда
			  ТекстОшибки = СтрШаблон(НСтр("ru = 'Для Грузового места ""%1"", рейса ""%2"" не заполнено ВГХ ""Длина"" .'"),Выборка.ПредставлениеГрузовоеМесто,ПредставлениеРейса);
			  Структура = Новый Структура;
			  Структура.Вставить("Текст",ТекстОшибки);
			  Структура.Вставить("Поле",ПолеГрузовыхМест);
			  МассивОшибки.Добавить(Структура);
			  Продолжить;
		  КонецЕсли;
		  Если Выборка.Ширина = 0 Тогда
			  ТекстОшибки = СтрШаблон(НСтр("ru = 'Для Грузового места ""%1"", рейса ""%2"" не заполнено ВГХ ""Ширина"" .'"),Выборка.ПредставлениеГрузовоеМесто,ПредставлениеРейса);
			  Структура = Новый Структура;
			  Структура.Вставить("Текст",ТекстОшибки);
			  Структура.Вставить("Поле",ПолеГрузовыхМест);
			  МассивОшибки.Добавить(Структура);
			  Продолжить;
		  КонецЕсли;
		  Если Выборка.Высота = 0 Тогда
			  ТекстОшибки = СтрШаблон(НСтр("ru = 'Для Грузового места ""%1"", рейса ""%2"" не заполнено ВГХ ""Высота"" .'"),Выборка.ПредставлениеГрузовоеМесто,ПредставлениеРейса);
			  Структура = Новый Структура;
			  Структура.Вставить("Текст",ТекстОшибки);
			  Структура.Вставить("Поле",ПолеГрузовыхМест);
			  МассивОшибки.Добавить(Структура);
			  Продолжить;
		  КонецЕсли;
		  Если Выборка.Масса = 0 Тогда
			  ТекстОшибки = СтрШаблон(НСтр("ru = 'Для Грузового места ""%1"", рейса ""%2"" не заполнено ВГХ ""Масса"" .'"),Выборка.ПредставлениеГрузовоеМесто,ПредставлениеРейса);
			  Структура = Новый Структура;
			  Структура.Вставить("Текст",ТекстОшибки);
			  Структура.Вставить("Поле",ПолеГрузовыхМест);
			  МассивОшибки.Добавить(Структура);
			  Продолжить;
		  КонецЕсли;
		  Счетчик_val = Счетчик_val+1;
		  XMLЗапись.ЗаписатьНачалоЭлемента("item");
		  XMLЗапись.ЗаписатьАтрибут("val", Формат(Счетчик_val,ТекущийФормат));
		  XMLЗапись.ЗаписатьАтрибут("kind", "box");
		   XMLЗапись.ЗаписатьНачалоЭлемента("name");		   
		   XMLЗапись.ЗаписатьТекст(Выборка.Код);
		   XMLЗапись.ЗаписатьКонецЭлемента();
		   XMLЗапись.ЗаписатьНачалоЭлемента("length");
		   XMLЗапись.ЗаписатьТекст(Формат(Выборка.Длина*1000,ТекущийФормат));
		   XMLЗапись.ЗаписатьКонецЭлемента();
		   XMLЗапись.ЗаписатьНачалоЭлемента("width");
		   XMLЗапись.ЗаписатьТекст(Формат(Выборка.Ширина*1000,ТекущийФормат));
		   XMLЗапись.ЗаписатьКонецЭлемента();
		   XMLЗапись.ЗаписатьНачалоЭлемента("height");
		   XMLЗапись.ЗаписатьТекст(Формат(Выборка.Высота*1000,ТекущийФормат));
		   XMLЗапись.ЗаписатьКонецЭлемента();
		   XMLЗапись.ЗаписатьНачалоЭлемента("mass");
		   XMLЗапись.ЗаписатьТекст(Формат(Выборка.Масса*КоэффициентПересчетаМассы,ТекущийФормат));
		   XMLЗапись.ЗаписатьКонецЭлемента();
		   XMLЗапись.ЗаписатьНачалоЭлемента("balt_id");
		   XMLЗапись.ЗаписатьКонецЭлемента();
		   XMLЗапись.ЗаписатьНачалоЭлемента("price");
		   XMLЗапись.ЗаписатьТекст(Формат(Выборка.Сумма,ТекущийФормат));
		   XMLЗапись.ЗаписатьКонецЭлемента();
		   XMLЗапись.ЗаписатьНачалоЭлемента("dir");
		   XMLЗапись.ЗаписатьКонецЭлемента();
		   XMLЗапись.ЗаписатьНачалоЭлемента("order");
		   XMLЗапись.ЗаписатьКонецЭлемента();
		   XMLЗапись.ЗаписатьНачалоЭлемента("group");
		   XMLЗапись.ЗаписатьКонецЭлемента();
		   XMLЗапись.ЗаписатьНачалоЭлемента("group");
		   XMLЗапись.ЗаписатьКонецЭлемента();
		   XMLЗапись.ЗаписатьНачалоЭлемента("press");
		   XMLЗапись.ЗаписатьКонецЭлемента();
		   XMLЗапись.ЗаписатьНачалоЭлемента("fragility");
		   XMLЗапись.ЗаписатьКонецЭлемента();
		   XMLЗапись.ЗаписатьНачалоЭлемента("freezable");
		   XMLЗапись.ЗаписатьТекст("0");
		   XMLЗапись.ЗаписатьКонецЭлемента();
		   XMLЗапись.ЗаписатьНачалоЭлемента("level");
		   XMLЗапись.ЗаписатьТекст("0");
		   XMLЗапись.ЗаписатьКонецЭлемента();
		   XMLЗапись.ЗаписатьНачалоЭлемента("only4bottom");
		   XMLЗапись.ЗаписатьТекст("0");
		   XMLЗапись.ЗаписатьКонецЭлемента();
		   XMLЗапись.ЗаписатьНачалоЭлемента("color");
		   XMLЗапись.ЗаписатьТекст("#0000BF");
		   XMLЗапись.ЗаписатьКонецЭлемента();
		   
		   XMLЗапись.ЗаписатьНачалоЭлемента("quantity");
		   XMLЗапись.ЗаписатьТекст("1");
		   XMLЗапись.ЗаписатьКонецЭлемента();
		  XMLЗапись.ЗаписатьКонецЭлемента(); //item
	  КонецЦикла;
	  Unixtime = Формат(ДатаРегистрации-ДАТА("19700101000000"),"ЧН=0; ЧГ=0");
	  XMLЗапись.ЗаписатьКонецЭлемента(); //items
	  XMLЗапись.ЗаписатьНачалоЭлемента("element");
	  XMLЗапись.ЗаписатьАтрибут("type", "DateTime");
	  XMLЗапись.ЗаписатьАтрибут("name", "create_time");
	  XMLЗапись.ЗаписатьТекст(Unixtime);
	  XMLЗапись.ЗаписатьКонецЭлемента();
	  XMLЗапись.ЗаписатьНачалоЭлемента("element");
	  XMLЗапись.ЗаписатьАтрибут("type", "DateTime");
	  XMLЗапись.ЗаписатьАтрибут("name", "confirm_time");
	  XMLЗапись.ЗаписатьТекст(Unixtime);
	  XMLЗапись.ЗаписатьКонецЭлемента();
	 
	 XMLЗапись.ЗаписатьКонецЭлемента(); //task
	 
	 Счетчик_val = Счетчик_val+1;
    
	 XMLЗапись.ЗаписатьНачалоЭлемента("element");
	 XMLЗапись.ЗаписатьАтрибут("type", "RootRef");
	 XMLЗапись.ЗаписатьАтрибут("name", "rest");
	 XMLЗапись.ЗаписатьАтрибут("val", Формат(Счетчик_val,ТекущийФормат));
	 XMLЗапись.ЗаписатьАтрибут("storage", "TaskSimple");
	 
	  XMLЗапись.ЗаписатьНачалоЭлемента("element");
	  XMLЗапись.ЗаписатьАтрибут("type", "String");
	  XMLЗапись.ЗаписатьАтрибут("name", "m_name");
	  XMLЗапись.ЗаписатьТекст("&#x41F;&#x43B;&#x430;&#x43D; &#x417;&#x430;&#x433;&#x440;&#x443;&#x437;&#x43A;&#x438;");
	  XMLЗапись.ЗаписатьКонецЭлемента();
	  XMLЗапись.ЗаписатьНачалоЭлемента("element");
	  XMLЗапись.ЗаписатьАтрибут("type", "String");
	  XMLЗапись.ЗаписатьАтрибут("name", "m_descr");
	  XMLЗапись.ЗаписатьКонецЭлемента();
	  XMLЗапись.ЗаписатьНачалоЭлемента("element");
	  XMLЗапись.ЗаписатьАтрибут("type", "UShort");
	  XMLЗапись.ЗаписатьАтрибут("name", "m_prio");
	  XMLЗапись.ЗаписатьТекст("0");
	  XMLЗапись.ЗаписатьКонецЭлемента();
	  XMLЗапись.ЗаписатьНачалоЭлемента("element");
	  XMLЗапись.ЗаписатьАтрибут("type", "UShort");
	  XMLЗапись.ЗаписатьАтрибут("name", "m_status");
	  XMLЗапись.ЗаписатьТекст("3");
	  XMLЗапись.ЗаписатьКонецЭлемента();
	  
	  Счетчик_val = Счетчик_val+1;
	  
	  XMLЗапись.ЗаписатьНачалоЭлемента("vehicles");
	  XMLЗапись.ЗаписатьАтрибут("val", Формат(Счетчик_val,ТекущийФормат));
	  XMLЗапись.ЗаписатьАтрибут("element", "vlist");
	  ВыборкаТС.Сбросить();
	  Если ВыборкаТС.Следующий() И МассивОшибки.Количество()=0 Тогда
		  Счетчик_val = Счетчик_val+1;
		  XMLЗапись.ЗаписатьНачалоЭлемента("vehicle");
		  XMLЗапись.ЗаписатьАтрибут("val", Формат(Счетчик_val,ТекущийФормат));
		  XMLЗапись.ЗаписатьАтрибут("id", "0");
		  XMLЗапись.ЗаписатьАтрибут("kind", "container");
		   XMLЗапись.ЗаписатьНачалоЭлемента("quantity");
		   XMLЗапись.ЗаписатьТекст("1");
		   XMLЗапись.ЗаписатьКонецЭлемента();
		   XMLЗапись.ЗаписатьНачалоЭлемента("length");
		   XMLЗапись.ЗаписатьТекст(Формат(ВыборкаТС.Длина*1000,ТекущийФормат));
		   XMLЗапись.ЗаписатьКонецЭлемента();
		   XMLЗапись.ЗаписатьНачалоЭлемента("width");
		   XMLЗапись.ЗаписатьТекст(Формат(ВыборкаТС.Ширина*1000,ТекущийФормат));
		   XMLЗапись.ЗаписатьКонецЭлемента();
		   XMLЗапись.ЗаписатьНачалоЭлемента("height");
		   XMLЗапись.ЗаписатьТекст(Формат(ВыборкаТС.Высота*1000,ТекущийФормат));
		   XMLЗапись.ЗаписатьКонецЭлемента();
		   XMLЗапись.ЗаписатьНачалоЭлемента("tonnage");
		   XMLЗапись.ЗаписатьТекст(Формат(ВыборкаТС.Грузоподъемность*КоэффициентПересчетаМассы,ТекущийФормат));
		   XMLЗапись.ЗаписатьКонецЭлемента();
		   XMLЗапись.ЗаписатьНачалоЭлемента("name");
		   XMLЗапись.ЗаписатьТекст(ВыборкаТС.Наименование);
		   XMLЗапись.ЗаписатьКонецЭлемента();
		  XMLЗапись.ЗаписатьКонецЭлемента();
	  КонецЕсли;
	  XMLЗапись.ЗаписатьКонецЭлемента();//vehicles
	  
	  XMLЗапись.ЗаписатьНачалоЭлемента("vehicles");
	  XMLЗапись.ЗаписатьАтрибут("val", Формат(Счетчик_val,ТекущийФормат));
	  XMLЗапись.ЗаписатьАтрибут("element", "plist");
	  XMLЗапись.ЗаписатьКонецЭлемента();
	  
	  Счетчик_val = Счетчик_val+1;
	  
	  XMLЗапись.ЗаписатьНачалоЭлемента("types");
	  XMLЗапись.ЗаписатьАтрибут("val", Формат(Счетчик_val,ТекущийФормат));
	  XMLЗапись.ЗаписатьАтрибут("element", "tlist");
	  XMLЗапись.ЗаписатьКонецЭлемента();
	  
	  Счетчик_val = Счетчик_val+1;
	  
	  XMLЗапись.ЗаписатьНачалоЭлемента("items");
	  XMLЗапись.ЗаписатьАтрибут("val", Формат(Счетчик_val,ТекущийФормат));
	  XMLЗапись.ЗаписатьАтрибут("element", "ilist");
	  Если МассивОшибки.Количество()=0 Тогда
		  Выборка.Сбросить();
		  Пока Выборка.Следующий() Цикл
			  Счетчик_val = Счетчик_val+1;
			  XMLЗапись.ЗаписатьНачалоЭлемента("item");
			  XMLЗапись.ЗаписатьАтрибут("val", Формат(Счетчик_val,ТекущийФормат));
			  XMLЗапись.ЗаписатьАтрибут("kind", "box");
			  XMLЗапись.ЗаписатьНачалоЭлемента("name");		   
			  XMLЗапись.ЗаписатьТекст(Выборка.Код);
			  XMLЗапись.ЗаписатьКонецЭлемента();
			  XMLЗапись.ЗаписатьНачалоЭлемента("length");
			  XMLЗапись.ЗаписатьТекст(Формат(Выборка.Длина*1000,ТекущийФормат));
			  XMLЗапись.ЗаписатьКонецЭлемента();
			  XMLЗапись.ЗаписатьНачалоЭлемента("width");
			  XMLЗапись.ЗаписатьТекст(Формат(Выборка.Ширина*1000,ТекущийФормат));
			  XMLЗапись.ЗаписатьКонецЭлемента();
			  XMLЗапись.ЗаписатьНачалоЭлемента("height");
			  XMLЗапись.ЗаписатьТекст(Формат(Выборка.Высота*1000,ТекущийФормат));
			  XMLЗапись.ЗаписатьКонецЭлемента();
			  XMLЗапись.ЗаписатьНачалоЭлемента("mass");
			  XMLЗапись.ЗаписатьТекст(Формат(Выборка.Масса*КоэффициентПересчетаМассы,ТекущийФормат));
			  XMLЗапись.ЗаписатьКонецЭлемента();
			  XMLЗапись.ЗаписатьНачалоЭлемента("balt_id");
			  XMLЗапись.ЗаписатьКонецЭлемента();
			  XMLЗапись.ЗаписатьНачалоЭлемента("price");
			  XMLЗапись.ЗаписатьТекст(Формат(Выборка.Сумма,ТекущийФормат));
			  XMLЗапись.ЗаписатьКонецЭлемента();
			  XMLЗапись.ЗаписатьНачалоЭлемента("dir");
			  XMLЗапись.ЗаписатьКонецЭлемента();
			  XMLЗапись.ЗаписатьНачалоЭлемента("order");
			  XMLЗапись.ЗаписатьКонецЭлемента();
			  XMLЗапись.ЗаписатьНачалоЭлемента("group");
			  XMLЗапись.ЗаписатьКонецЭлемента();
			  XMLЗапись.ЗаписатьНачалоЭлемента("group");
			  XMLЗапись.ЗаписатьКонецЭлемента();
			  XMLЗапись.ЗаписатьНачалоЭлемента("press");
			  XMLЗапись.ЗаписатьКонецЭлемента();
			  XMLЗапись.ЗаписатьНачалоЭлемента("fragility");
			  XMLЗапись.ЗаписатьКонецЭлемента();
			  XMLЗапись.ЗаписатьНачалоЭлемента("freezable");
			  XMLЗапись.ЗаписатьТекст("0");
			  XMLЗапись.ЗаписатьКонецЭлемента();
			  XMLЗапись.ЗаписатьНачалоЭлемента("level");
			  XMLЗапись.ЗаписатьТекст("0");
			  XMLЗапись.ЗаписатьКонецЭлемента();
			  XMLЗапись.ЗаписатьНачалоЭлемента("only4bottom");
			  XMLЗапись.ЗаписатьТекст("0");
			  XMLЗапись.ЗаписатьКонецЭлемента();
			  XMLЗапись.ЗаписатьНачалоЭлемента("color");
			  XMLЗапись.ЗаписатьТекст("#0000BF");
			  XMLЗапись.ЗаписатьКонецЭлемента();
			  
			  XMLЗапись.ЗаписатьНачалоЭлемента("quantity");
			  XMLЗапись.ЗаписатьТекст("1");
			  XMLЗапись.ЗаписатьКонецЭлемента();
			  XMLЗапись.ЗаписатьКонецЭлемента(); //item
		  КонецЦикла;
	  КонецЕсли;
	  Unixtime1 = Формат(ТекущаяДата()-ДАТА("19700101000000"),"ЧН=0; ЧГ=0");
	  XMLЗапись.ЗаписатьКонецЭлемента(); //items
	  XMLЗапись.ЗаписатьНачалоЭлемента("element");
	  XMLЗапись.ЗаписатьАтрибут("type", "DateTime");
	  XMLЗапись.ЗаписатьАтрибут("name", "create_time");
	  XMLЗапись.ЗаписатьТекст(Unixtime1);
	  XMLЗапись.ЗаписатьКонецЭлемента();
	  XMLЗапись.ЗаписатьНачалоЭлемента("element");
	  XMLЗапись.ЗаписатьАтрибут("type", "DateTime");
	  XMLЗапись.ЗаписатьАтрибут("name", "confirm_time");
	  XMLЗапись.ЗаписатьТекст(Unixtime);
	  XMLЗапись.ЗаписатьКонецЭлемента();
	 
	 XMLЗапись.ЗаписатьКонецЭлемента(); //rest
	 
	 XMLЗапись.ЗаписатьНачалоЭлемента("element");
	 XMLЗапись.ЗаписатьАтрибут("type", "String");
	 XMLЗапись.ЗаписатьАтрибут("name", "recommend");
	 XMLЗапись.ЗаписатьКонецЭлемента();
	 
	 XMLЗапись.ЗаписатьНачалоЭлемента("element");
	 XMLЗапись.ЗаписатьАтрибут("type", "Long");
	 XMLЗапись.ЗаписатьАтрибут("name", "status_value");
	 XMLЗапись.ЗаписатьТекст("1");
	 XMLЗапись.ЗаписатьКонецЭлемента();
	 
	 XMLЗапись.ЗаписатьНачалоЭлемента("element");
	 XMLЗапись.ЗаписатьАтрибут("type", "String");
	 XMLЗапись.ЗаписатьАтрибут("name", "user_value");
	 XMLЗапись.ЗаписатьКонецЭлемента();
	 
	 XMLЗапись.ЗаписатьНачалоЭлемента("element");
	 XMLЗапись.ЗаписатьАтрибут("type", "String");
	 XMLЗапись.ЗаписатьАтрибут("name", "host_value");
	 XMLЗапись.ЗаписатьКонецЭлемента();
	 
	 XMLЗапись.ЗаписатьНачалоЭлемента("element");
	 XMLЗапись.ЗаписатьАтрибут("type", "Long");
	 XMLЗапись.ЗаписатьАтрибут("name", "success_min_value");
	 XMLЗапись.ЗаписатьТекст("0");
	 XMLЗапись.ЗаписатьКонецЭлемента();
	 
	 XMLЗапись.ЗаписатьНачалоЭлемента("element");
	 XMLЗапись.ЗаписатьАтрибут("type", "Long");
	 XMLЗапись.ЗаписатьАтрибут("name", "success_max_value");
	 XMLЗапись.ЗаписатьТекст("0");
	 XMLЗапись.ЗаписатьКонецЭлемента();
	 
	 XMLЗапись.ЗаписатьНачалоЭлемента("element");
	 XMLЗапись.ЗаписатьАтрибут("type", "String");
	 XMLЗапись.ЗаписатьАтрибут("name", "func_value");
	 XMLЗапись.ЗаписатьКонецЭлемента();
	 
	 XMLЗапись.ЗаписатьНачалоЭлемента("element");
	 XMLЗапись.ЗаписатьАтрибут("type", "Block");
	 XMLЗапись.ЗаписатьАтрибут("name", "elements");
	 XMLЗапись.ЗаписатьАтрибут("size", "0");
	 XMLЗапись.ЗаписатьКонецЭлемента();
	 
	 XMLЗапись.ЗаписатьНачалоЭлемента("element");
	 XMLЗапись.ЗаписатьАтрибут("type", "Real");
	 XMLЗапись.ЗаписатьАтрибут("name", "work_time");
	 XMLЗапись.ЗаписатьТекст("-2.01358");
	 XMLЗапись.ЗаписатьКонецЭлемента();
	
	XMLЗапись.ЗаписатьКонецЭлемента();//dapl
	
	Если МассивОшибки.Количество() Тогда
		XMLЗапись = Неопределено;
		Структура = Новый Структура;
		Структура.Вставить("Ошибки",МассивОшибки);
		Возврат Структура;
	Иначе
		ТекстXML = XMLЗапись.Закрыть();
		Возврат ТекстXML;
	КонецЕсли;
	
КонецФункции // ПолучитьТекстРасчётаВФорматеPacker3DXML()


#КонецОбласти
